l1 = ["один",
      "два",
      "три",
      "четыре",
      "пять",
      "шесть",
      "семь",
      "восемь",
      "девять",
      "десять",
      "одиннадцать",
      "двенадцать",
      "тринадцать",
      "четырнадцать",
      "пятнадцать",
      "шестнадцать",
      "семнадцать",
      "восемнадцать",
      "девятнадцать"]

l2 = ['десять',
      'двадцать',
      'тридцать',
      'сорок',
      'пятьдесят',
      'шестьдесят',
      'семьдесят',
      'восемьдесят',
      'девяносто']


def number_to_words(n):
    if n <= 19:
        return l1[n - 1]
    else:
        n = str(n)
        if n[-1] == '0':
            return l2[int(n[0]) - 1]
        else:
            return f'{l2[int(n[0]) - 1]} {l1[int(n[1]) - 1]}'
